Public Member Functions | Protected Member Functions | List of all members
ACAPI::MEP::PortBase::Modifier Class Reference
MEP Element Manager
Modifier of the PortBase. More...
#include <MEPPortBase.hpp>
 Inheritance diagram for ACAPI::MEP::PortBase::Modifier:
 Public Member Functions
Result< void >  | SetWidth (double width)
Sets the width of the port.
Result< void >  | SetHeight (double height)
Sets the height of the port.
Result< void >  | SetShape (ConnectorShape shape)
Sets the shape of the port.
Result< void >  | SetMEPSystem (const API_AttributeIndex &attributeIndex)
Sets the MEPSystem attribute of a Port.
 Protected Member Functions
Modifier (PortBase &parent)
Constructs a Modifier with the given port base parent.
 void  | FinalizeModification () override
Finalizes the modifications.
Detailed Description
Modifier of the PortBase.
Constructor & Destructor Documentation
◆ Modifier()
 ACAPI::MEP::PortBase::Modifier::Modifier  |  ( |  PortBase & |  parent | )
protected
Constructs a Modifier with the given port base parent.
Parameters
parent | The parent port base.
Member Function Documentation
◆ SetHeight()
 Result< void > ACAPI::MEP::PortBase::Modifier::SetHeight  |  ( |  double |  height | )
Sets the height of the port.
Parameters
height | The value to be set.
Returns
Returns an error if you are trying to modify a Port of a Branch, otherwise nothing.
◆ SetMEPSystem()
 Result< void > ACAPI::MEP::PortBase::Modifier::SetMEPSystem  |  ( |  const API_AttributeIndex & |  attributeIndex | )
Sets the MEPSystem attribute of a Port.
Parameters
attributeIndex | The MEPSystem AttributeIndex to be set.
Returns
Returns an error if you are trying to modify a Port of a Branch or a Port which has a derived MEPSystem (e.g. the Ports of a RigidSegment), otherwise nothing.
◆ SetShape()
 Result< void > ACAPI::MEP::PortBase::Modifier::SetShape  |  ( |  ConnectorShape |  shape | )
Sets the shape of the port.
Parameters
shape | The shape to be set.
Returns
Returns an error if you are trying to modify a Port of a Branch, otherwise nothing.
◆ SetWidth()
 Result< void > ACAPI::MEP::PortBase::Modifier::SetWidth  |  ( |  double |  width | )
Sets the width of the port.
Parameters
width | The value to be set.
Returns
Returns an error if you are trying to modify a Port of a Branch, otherwise nothing.